{"number":"699","title":"Falling Squares","url":"https://leetcode.com/problems/falling-squares","difficulty":"Hard","question":"On an infinite number line (x-axis), we drop given squares in the order they are given.\n\nThe i-th square dropped (positions[i] = (left, side_length)) is a square with the left-most point being positions[i][0] and sidelength positions[i][1].\n\nThe square is dropped with the bottom edge parallel to the number line, and from a higher height than all currently landed squares. We wait for each square to stick before dropping the next.\n\nThe squares are infinitely sticky on their bottom edge, and will remain fixed to any positive length surface they touch (either the number line or another square). Squares dropped adjacent to each other will not stick together prematurely.\n&#xA0;\n\nReturn a list ans of heights. Each height ans[i] represents the current highest height of any square we have dropped, after dropping squares represented by positions[0], positions[1], ..., positions[i].\n\nExample 1:\n\nInput: [[1, 2], [2, 3], [6, 1]]\nOutput: [2, 5, 5]\nExplanation:\n\n\nAfter the first drop of positions[0] = [1, 2]: _aa _aa ------- The maximum height of any square is 2.\n\nAfter the second drop of positions[1] = [2, 3]: __aaa __aaa __aaa _aa__ _aa__ -------------- The maximum height of any square is 5. The larger square stays on top of the smaller square despite where its center of gravity is, because squares are infinitely sticky on their bottom edge.\n\nAfter the third drop of positions[1] = [6, 1]: __aaa __aaa __aaa _aa _aa___a -------------- The maximum height of any square is still 5. Thus, we return an answer of [2, 5, 5].\n\n&#xA0;\n&#xA0;\n\nExample 2:\n\nInput: [[100, 100], [200, 100]]\nOutput: [100, 100]\nExplanation: Adjacent squares don&apos;t get stuck prematurely - only their bottom edge can stick to surfaces.\n\n\n&#xA0;\n\nNote:\n\n\n\t1 &lt;= positions.length &lt;= 1000.\n\t1 &lt;= positions[i][0] &lt;= 10^8.\n\t1 &lt;= positions[i][1] &lt;= 10^6.\n\n\n&#xA0;\n","code":"undefinedpublic class Solution {    public IList<int> FallingSquares(int[][] positions) {            }}"}